<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<!DOCTYPE HTML>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>
<jsp:include page="Main_header.jsp"></jsp:include>
<html>
	<link rel="stylesheet"
		href="${pageContext.request.contextPath}/resources/assets/css/main.css" />
	<noscript>
		<link rel="stylesheet"
			href="${pageContext.request.contextPath}/resources/assets/css/noscript.css" />
	</noscript>	
	<!-- 형진햄 -->
	<style>
		ul{
			list-style:none;
		}
		
		.center{
			display:flex;
			justify-content: center;
			align-items: center;
			margin-top:5%;
		}
		
		.material-icons.orange600 { 
			color: #000000;
			font-size: 48px;
			border: 2px solid;
			border-radius :80px / 80px;
		 }
		 
		.material-icons.human{ 
			color : #000000;
			font-size: 48px;
			border: 2px solid;
			border-radius :80px /80px;
		}
		
		.material-icons.relation { 
			color :#0000FF;
			font-size: 48px;
		}
		
		.major1{
		   aligin:center;
		   border-bottom: solid 2px #D8D8D8 ;
		   display: inline-block;
		   position: relative;
		}
		.major1:after{
		   content: '';
		   display: block;
		   height: 1px;
		   opacity:0.3;
		}
	</style>
	
	<!-- 현우 style -->
	<style type="text/css">
		#aboutus {
			height: 100vh;
			overflow: hidden;
		}
		#aboutus > h2{
			clear:both;
			top:10%;
			position: relative;
			text-align: center;
		}
		#aboutus > .aboutbottom{
			top:1.5%;
			width:80%;
			margin:0 auto;
			position: relative;
			text-align: center;
		}
	</style>
	<!-- 차트 style -->
	<style>
		.area {
		    position: absolute;
		    background: #fff;
		    border: 1px solid #888;
		    border-radius: 3px;
		    font-size: 12px;
		    top: -5px;
		    left: 15px;
		    padding:2px;
		}
		
		.info {
		    font-size: 12px;
		    padding: 5px;
		}
		.info .title {
		    font-weight: bold;
		}
	</style>
	<!-- 차트 스크립트 -->
	<script src="https://d3js.org/d3.v5.min.js"></script>
	<script src="${pageContext.request.contextPath}/resources/billboard/billboard.js"></script>
	<link rel="stylesheet" href="${pageContext.request.contextPath}/resources/billboard/billboard.css">
	<script src="http://code.jquery.com/jquery-latest.min.js"></script>
	<script src="https://canvasjs.com/assets/script/canvasjs.min.js"></script>
	<script type="text/javascript" src="https://www.gstatic.com/charts/loader.js"></script>
	<script>google.charts.load('current', {packages:['corechart']});</script>
	<script type="text/javascript" src="//dapi.kakao.com/v2/maps/sdk.js?appkey=5af6228c342c0914ee05c34a6a0514fe "></script>
	<link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
	
	<body class="landing is-preload" style="min-width:980px;">
		<!-- Page Wrapper -->
		<div id="page-wrapper">
			<!-- Banner -->
			<section id="banner" style="background-image:url(${pageContext.request.contextPath}/resources/images/banner4.jpg);background-repeat:no-repeat;background-size:cover;">
				<div>
					<h2>Safety Busan</h2>
					<p>WAYS TO REDUCE CRIME IN BUSAN</p>
				</div>
				<a href="#aboutus" class="more scrolly">about us</a>
			</section>	
			
			<section id="aboutus" style="background-color:black;">
				<div class="video-container" style="text-align: center; margin-top: 25px;">
				<object type="text/html" width="740px;" height="500px;" data="//www.youtube.com/embed/dyll4xCHXio?rel=0;amp;autoplay=1">
				</object>
				</div>
				<div class="aboutbottom" style="color:white;">
					<h2 style="color:white;">ABOUT US</h2>
					<p>저희 홈페이지는 부산광역시에서 일어나는 5대 범죄의 범죄율에 관하여 사용자들이 쉽게 알아 볼 수 있는 
					다이어그램을 제공하며 각종 범죄의 예방법 및 부산광역시내의 자율방범활동을
					 통해 부산광역시에서의 범죄율을 낮추는것에 이바지 합니다.</p>
				</div>
			</section>
			<!-- 블로그 땡겨 오기 -->
			<section style="padding:3% 15%;" id="two" class="wrapper alt style2">
			
				<c:forEach var="blog" items="${blogData}" varStatus="status">
					<section>
							<h2><a style="text-decoration:none"href="${blog.link }"target="_blank">${blog.title }</a></h2>
							<p>${blog.description }</p>
					</section>					
				</c:forEach>
			</section>
			<!-- 년도별 범죄 페이지 -->
			<section id="statictics" class="wrapper style5 special">
				<div class="inner">
					<div class="major">
						<h2>부산시 구별 범죄발생통계</h2>
						<p id="total">본 통계자로는 각급 수사기관(검찰,경찰,특별사법경찰)에서 범죄 사건을 수사하면서 작성·전산입력한<br/>
						 각 범죄 통계원표(발생통계원표, 검거 통계원표, 피의자 통계원표)를 토대로 범죄현상을 분석하였습니다.</p>
					</div>
					<div style="width:100%;height:800px;margin-left:5%;">
					<p style="width:100%;margin-bottom:-1px;font-size:13px;text-align:left;float:left;">※지도 클릭시 구별 5대 범죄 상세보기 / 범죄명 클릭시 범죄별 특성페이지로 이동</p>
						<div id="map" style="float:left;width:40%;height:380px;" align=center></div>
						<div id="infotable" style="float:left;margin-left:5%;width:50%;height:350px;">
							<table style="height:340px;">
							  <tr>
							  <td id="area_name" style="width:200px;font-weight:bolder;font-size:20px;">중구</td>
							  <td style="width:200px;font-weight:bolder;">2016</td>
							  <td style="width:200px;font-weight:bolder;">2017</td>
							  <td style="width:200px;font-weight:bolder;">2018</td>
							  </tr>
							  <tr><td onClick="murder()" style="cursor:pointer;">살인</td><td id="2016_1">6</td><td id="2017_1">0</td><td id="2018_1">0</td></tr>
							  <tr><td onClick="robber()" style="cursor:pointer;">강도</td><td id="2016_2">12</td><td id="2017_1">8</td><td id="2018_2">0</td></tr>
							  <tr><td onClick="rape()" style="cursor:pointer;">성폭력</td><td id="2016_3">39</td><td id="2017_1">39</td><td id="2018_3">0</td></tr>
							  <tr><td onClick="thief()" style="cursor:pointer;">절도</td><td id="2016_4">864</td><td id="2017_1">658</td><td id="2018_4">0</td></tr>
							  <tr><td onClick="violence()" style="cursor:pointer;">폭력</td><td id="2016_5">801</td><td id="2017_1">446</td><td id="2018_5">0</td></tr>
							</table>
						</div>
						<div id="graph" style="float:left;margin-left:100px;margin-top:50px;width:800px;height:350px;">
						<div id="categoryAxis" style="width:800px;height:350px;"></div>
						<br/>
						&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;범죄발생시간
						</div>
					</div>
				</div>
			</section>

			<section id="murder" class="wrapper style5 special">
				<div class="inner">
					<div class="major">
						<h2>살인범죄 특성</h2>
						<p onClick="back()" style="margin-left:10px;margin-right:-30px;float:right;cursor:pointer;">전체통계로 이동</p>
						<p style="float:right;margin-left:10px;">/</p>
						<p onClick="murderback()" style="float:right;cursor:pointer;">페이지 접기</p>
					</div>
					<div style="width:1300px;height:700px;">
					<div id="chartContainer1" style="float:left;margin-left:80px;width:550px;height:350px;"></div>
					<div style="float:left;margin-left:20px;text-align:left;width:550px;height:350px;">
					<br/>
					<h3>범죄자와 피해자의 관계</h3>
					<p> 살인범죄 범죄자와 피해자의 관계를 살펴보면, 전체의 20.3%가 타인인 것으로 나타났다.
						타인 외의 관계에서는, 친족관계인 경우가 전체의 25.5%로 가장 많았고,<br/> 그 다음이 이웃/
						지인(16.8%), 애인(7.8%), 친구/직장동료(8.1%) 등의 순이었다</p>
					</div>
					<div style="float:left;display:inline-block;" id="chart_div1"></div>
						<div style="float:left;margin-top:80px;margin-left:10px;text-align:left;width:550px;height:350px;">
							<h3>주요 살인범죄 유형별 구성비</h3>
							<p> 살인범죄의 유형은 일반 살인범죄가 84.7%를 차지하고 있으며,<br/>
							 존속살해 8.4%, 자살교사/방조 5.8%, 영아살해 0.8%, 촉탁살인 0.4%이 발생하였다.</p>
						</div>
					</div>
				</div>
			
			</section>
		<!-- 강도 -->
		<section id="robber" class="wrapper style5 special">
			<div class="inner">
				<div class="major">
					<h2>강도범죄 특성</h2>
					<p onClick="back()" style="margin-left:10px;margin-right:-30px;float:right;cursor:pointer;">전체통계로 이동</p>
					<p style="float:right;margin-left:10px;">/</p>
					<p onClick="robberback()" style="float:right;cursor:pointer;">페이지 접기</p>
				</div>
				
		<div style="width:1300px;height:700px;">
		<div id="chartContainer2" style="float:left;margin-left:80px;width:593px;height:350px;"></div>
		<div style="float:left;margin-left:20px;text-align:left;width:550px;height:350px;">
		<br/>
		<h3>강도범죄의 범행수법</h3>
		<p>범행수법별로는 침입강도가 42.4%로 가장 많았고,<br/> 그 다음이 기타 39.2%, 노상강도 11.9%의 순이었다.
			마취강도는 3.3%, 차량강도, 인질강도, 강도강간은 각각 0.7%,0.7%,0.4%의 낮은 비율을 차지하였다.</p>
	</div>
	<script>
		document.getElementById("robber").style.display="none";
	</script>
	<script>
	
	var chart2 = new CanvasJS.Chart("chartContainer2", {
		animationEnabled: true,
		data: [{
			type: "pie",
			startAngle: 240,
			yValueFormatString: "##0.00\"%\"",
			indexLabel: "{label} {y}",
			dataPoints: [
				{ y: 39.2, label: "기타" },
				{ y: 42.4, label: "침입강도" },
				{ y: 11.9, label: "노상강도" },
				{ y: 1.3, label: "차내강도" },
				{ y: 0.7, label: "차량이용강도" },
				{ y: 3.3, label: "마취강도" },
				{ y: 0.7, label: "인질강도" },
				{ y: 0.4, label: "강도강간" }
			]
		}]
	});
	chart2.render();
	</script>
	
	<div style="float:left;display:inline-block;" id="chart_div2"></div>
	<div style="float:left;margin-top:80px;margin-left:10px;text-align:left;width:550px;height:350px;">
		<h3>강도범죄의 범죄발생장소</h3>
		<p> 강도범죄는 기타를 제외하면, 노상에서 발생하는 경우가 30%로 가장 많았다.<br/>
			 그 다음으로는 주거지 19.4%, 상점 16.4%, 숙박업소/목욕탕 9.5%등의 순이었다</p>
	</div>
	<script>
	// 로딩 완료시 함수 실행하여 차트 생성
	google.charts.setOnLoadCallback(drawChart2);
	
	var chart_options2 = {
		width : 680,
		height : 350,
		bar : {
			groupWidth : '45%'
		},
		legend : {
			position : 'none'
		}
	};
	
	function drawChart2(){
	
		var data2 = google.visualization.arrayToDataTable([
			['', '', {role : 'annotation'}], // 그래프 위에 설명 추가 {role : 'annotation'}
			['기타', 17.8, '17.8'], // 맨뒤 내용 "개 4" 는 그래프에 표시될 설명 지정 (안하면 에러남)
			['주거지', 19.4, '19.4'], // [항목이름, 값(숫자), 그래프 설명]
			['노상', 30.0, '30.0'],
			['상점', 16.4, '16.4'],
			['숙박업소,\n목욕탕', 9.5, '9.5'],
			['유흥접객\n업소', 6.9, '6.9']
		]);
	
		var chart2 = new google.visualization.ColumnChart(document.getElementById('chart_div2'));
		chart2.draw(data2, chart_options2);
	}
	</script>
	</div>
</div>
</section>

<!-- 성폭력 -->
<section id="rape" class="wrapper style5 special">
			<div class="inner">
				<div class="major">
					<h2>성폭력범죄 특성</h2>
					<p onClick="back()" style="margin-left:10px;margin-right:-30px;float:right;cursor:pointer;">전체통계로 이동</p>
					<p style="float:right;margin-left:10px;">/</p>
					<p onClick="rapeback()" style="float:right;cursor:pointer;">페이지 접기</p>
				</div>
				
<div style="width:1300px;height:700px;">
	<div id="chartContainer3" style="float:left;margin-left:120px;width:550px;height:350px;"></div>
	<div style="float:left;margin-left:70px;text-align:left;width:550px;height:350px;">
		<br/>
		<h3>성폭력범죄의 범죄발생장소</h3>
		<p> 성폭력범죄는 기타를 제외하고 보면, 주거지(20.9%)에서 가장 많이 발생하였으며, 그다음으로는 교통수단(12.9%), 유흥접객업소(12.5%) 등의 순이었다.
			이외에도 노상과 숙박업소/목욕탕이 각각 12.3%와 10.6%를 차지하였다.</p>
	</div>
	<script>
		document.getElementById("rape").style.display="none";
	</script>
	<script>
	var chart3 = new CanvasJS.Chart("chartContainer3", {
		animationEnabled: true,
		data: [{
			type: "pie",
			startAngle: 240,
			yValueFormatString: "##0.00\"%\"",
			indexLabel: "{label} {y}",
			dataPoints: [
				{ y: 30.8, label: "기타" },
				{ y: 20.9, label: "주거지" },
				
				{ y: 12.3, label: "노상" },
				{ y: 12.9, label: "교통수단" },
				{ y: 12.5, label: "유흥접객업소" }
			]
		}]
	});
	chart3.render();
	
	</script>
	<div style="float:left;display:inline-block;" id="chart_div3"></div>
	<div style="float:left;margin-top:50px;text-align:left;width:550px;height:350px;">
		<h3>성폭력범죄 피해자의 연령</h3>
		<p> 성폭력범죄의 피해자는 21세~30세(39.6%)가 가장 많았다.<br/>
			그 다음은 16세~20세(20.0%), 31세~40세(12.9%) 등의 순이었다.
			전체 성폭력범죄 피해자의 9.2%가 15세 이하의 청소년이었고,<br/>
			61세 이상의 연령층은 2.6%를 차지하고 있다.</p>
	</div>
	<script>
	// 로딩 완료시 함수 실행하여 차트 생성
	google.charts.setOnLoadCallback(drawChart3);
	
	var chart_options3 = {
		width : 740,
		height : 350,
		bar : {
			groupWidth : '40%'
		},
		legend : {
			position : 'none'
		}
	};
	
	function drawChart3(){
	
		var data3 = google.visualization.arrayToDataTable([
			['', '', {role : 'annotation'}], // 그래프 위에 설명 추가 {role : 'annotation'}
			['15세 이하', 9.3, '9.3'], // 맨뒤 내용 "개 4" 는 그래프에 표시될 설명 지정 (안하면 에러남)
			['16세~20세', 20.0, '20.0'], // [항목이름, 값(숫자), 그래프 설명]
			['21세~30세', 39.6, '39.6'],
			['31세~40세', 12.9, '12.9'],
			['45세~50세', 9.3, '9.3'],
			['51세 이상', 8.8, '8.8']
		]);
	
		var chart3 = new google.visualization.ColumnChart(document.getElementById('chart_div3'));
		chart3.draw(data3, chart_options3);
	}
	</script>
	</div>
</div>
</section>

<!-- 절도 -->
<section id="thief" class="wrapper style5 special">
			<div class="inner">
				<div class="major">
					<h2>절도범죄 특성</h2>
					<p onClick="back()" style="margin-left:10px;margin-right:-30px;float:right;cursor:pointer;">전체통계로 이동</p>
					<p style="float:right;margin-left:10px;">/</p>
					<p onClick="thiefback()" style="float:right;cursor:pointer;">페이지 접기</p>
				</div>
				
<div style="width:1300px;height:700px;">
	<div id="chartContainer4" style="float:left;margin-left:80px;width:593px;height:350px;"></div>
	<div style="float:left;margin-left:20px;text-align:left;width:550px;height:350px;">
		<br/>
		<h3>절도범죄의 범죄발생장소</h3>
		<p>절도범죄의 발생장소는 기타(25.3%)를 제외해보면,<br/>
		 노상이 22.6%로 가장 많았고, 이외에도상점 19.0%,<br/> 주거지 13.0% 등의 순이었다.</p>
	</div>
	<script>
		document.getElementById("thief").style.display="none";
	</script>
	<script>
	var chart4 = new CanvasJS.Chart("chartContainer4", {
		animationEnabled: true,
		data: [{
			type: "pie",
			startAngle: 240,
			yValueFormatString: "##0.00\"%\"",
			indexLabel: "{label} {y}",
			dataPoints: [
				{ y: 25.3, label: "기타" },
				{ y: 13, label: "주거지" },
				{ y: 22.6, label: "노상" },
				{ y: 19.0, label: "상점" },
				{ y: 3.5, label: "숙박업소/목욕탕" },
				{ y: 8.7, label: "유흥접객업소" },
				{ y: 2.0, label: "사무실" },
				{ y: 30.0, label: "교통수단" },
				{ y: 2.9, label: "금융기관" },
			]
		}]
	});
	chart4.render();
	
	</script>
	<div style="float:left;display:inline-block;" id="chart_div4"></div>
	<div style="float:left;margin-top:80px;margin-left:10px;text-align:left;width:550px;height:350px;">
		<h3>절도범죄의 범행수법</h3>
		<p> 절도범죄의 범행수법은 기타(73.3%)를 제외해보면,<br/>
			침입절도가 14.3%로 가장 많았고, 치기절도20 11.5%,<br/> 속임수절도21 0.9%의 순이다.</p>
	</div>
	<script>
	// 로딩 완료시 함수 실행하여 차트 생성
	google.charts.setOnLoadCallback(drawChart4);
	
	var chart_options4 = {
		width : 680,
		height : 350,
		bar : {
			groupWidth : '35%'
		},
		legend : {
			position : 'none'
		}
	};
	
	function drawChart4(){
	
		var data4 = google.visualization.arrayToDataTable([
			['', '', {role : 'annotation'}], // 그래프 위에 설명 추가 {role : 'annotation'}
			['침입절도', 14.3, '14.3'], // 맨뒤 내용 "개 4" 는 그래프에 표시될 설명 지정 (안하면 에러남)
			['치기절도', 11.5, '11.5'], // [항목이름, 값(숫자), 그래프 설명]
			['속임수절도', 0.9, ''],
			['기타절도', 73.3, '73.3']
		]);
	
		var chart4 = new google.visualization.ColumnChart(document.getElementById('chart_div4'));
		chart4.draw(data4, chart_options4);
	}
	</script>
	</div>
</div>
</section>

<!-- 폭행 -->
<section id="violence" class="wrapper style5 special">
			<div class="inner">
				<div class="major">
					<h2>폭행범죄 특성</h2>
					<p onClick="back()" style="margin-left:10px;margin-right:-30px;float:right;cursor:pointer;">전체통계로 이동</p>
					<p style="float:right;margin-left:10px;">/</p>
					<p onClick="violenceback()" style="float:right;cursor:pointer;">페이지 접기</p>
				</div>
				
<div style="width:1300px;height:700px;">
	<div id="chartContainer5" style="float:left;margin-left:80px;width:593px;height:350px;"></div>
	<div style="float:left;margin-left:20px;text-align:left;width:550px;height:350px;">
		<br/>
		<h3>폭행범죄의 범죄발생장소</h3>
		<p>‌폭행/상해범죄는 기타를 제외하고 살펴보면, 노상(38.0%)에서 가장 많이 발생하는 것으로나타났다.
			그 다음으로는 주거지(22.0%), 유흥접객업소(14.8%) 등의 순이었다.</p>
	</div>
	<script>
		document.getElementById("violence").style.display="none";
	</script>
	<script>
	var chart5 = new CanvasJS.Chart("chartContainer5", {
		animationEnabled: true,
		data: [{
			type: "pie",
			startAngle: 240,
			yValueFormatString: "##0.00\"%\"",
			indexLabel: "{label} {y}",
			dataPoints: [
				{ y: 15.3, label: "기타" },
				{ y: 22.0, label: "주거지" },
				{ y: 38.0, label: "노상" },
				{ y: 3.8, label: "상점" },
				{ y: 1.5, label: "숙박업소" },
				{ y: 14.8, label: "유흥접객업소" },
				{ y: 2.6, label: "사무실" },
				{ y: 2.2, label: "교통수단" }
			]
		}]
	});
	chart5.render();
	
	</script>
	<div style="float:left;display:inline-block;" id="chart_div5"></div>
	<div style="float:left;margin-top:80px;text-align:left;width:550px;height:350px;">
		<h3>폭행/상해범죄 범죄자의 연령</h3>
		<p>폭행/상해범죄 범죄자의 주된 연령층은 41세~50세(22.4%)이고, 그 다음은 51세~60세(21.3%),
			 19세~30세(21.1%)의 순이다.</p>
	</div>
		<script>
		// 로딩 완료시 함수 실행하여 차트 생성
		google.charts.setOnLoadCallback(drawChart5);
		
		var chart_options5 = {
			width : 690,
			height : 350,
			bar : {
				groupWidth : '45%'
			},
			legend : {
				position : 'none'
			}
		};
		
		function drawChart5(){
		
			var data5 = google.visualization.arrayToDataTable([
				['', '', {role : 'annotation'}], // 그래프 위에 설명 추가 {role : 'annotation'}
				['18세 이하', 5.8, '5.8'], // 맨뒤 내용 "개 4" 는 그래프에 표시될 설명 지정 (안하면 에러남)
				['19~30세', 21.1, '21.1'], // [항목이름, 값(숫자), 그래프 설명]
				['31~40세', 18.4, '18.4'],
				['41~50세', 22.4, '22.4'],
				['51~60세', 21.3, '21.3'],
				['60세 이상', 11.0, '11.0']
			]);
		
			var chart5 = new google.visualization.ColumnChart(document.getElementById('chart_div5'));
			chart5.draw(data5, chart_options5);
		}
		</script>
		</div>
	</div>
</section>

	<section id="three" class="wrapper style3 special">
		<div class="inner">
			<header class="major">
				<h2>범죄 예방 블로그및 관련 뉴스</h2>
			</header>
			<ul class="features">
				<c:forEach var="blog" items="${blogData}">
					<li class="icon fa-heart">
						<h3><a href="${blog.link}"target="_blank">${blog.title}</a></h3>
						<p>${blog.description}</p>
					</li>
				</c:forEach>
				<c:forEach var="news" items="${NewsData}">
					<li class="icon solid fa-laptop">
						<h3><a href="${news.link}"target="_blank">${news.title}</a></h3>
						<p>${news.description}</p>
					</li>
				</c:forEach>
			</ul>
		</div>
	</section>
	
<!-- 시민 참여 소통 게시판 -->
<section id="community" class="wrapper style5" style="height:700px; align:center;" >
    <div class="inner" style="align:center;" >
	    <header class="major1" style="margin:0 0 0 15em;" >
	    	<h2 style="padding:0 7em 0 6em;">시민참여 소통 게시판</h2> 
	    </header>
    </div>
    <div class="center" style="text-align:center;">
       <ul style="margin-right:5%;">
          <li><i class="material-icons human">supervised_user_circle</i></li> 
          <li><h2>Community</h2></li>   
          <li style="margin-bottom:5%"><a href="notice/list">공지사항</a></li>
          <li style="margin-bottom:5%"><a href="qnaboard/listReply">질문과답변</a></li>
          <li><a href="acboard/listReply">사건사고 게시판</a></li>
       </ul>
       <ul>
          <li><i class="material-icons orange600">security</i></li> 
          <li><h2>Crime Guard</h2></li>
          <li style="margin-bottom:5%"><a href="Support/board_list">방범활동모집</a></li>
          <li style="margin-bottom:5%"><a href="GuardBoard/Guard_list">활동소식 게시판</a></li>
          <li>&nbsp;</li>
       </ul>
    </div>
</section>
<jsp:include page="footer.jsp"></jsp:include>
	</div>
		<!-- Scripts -->
		<script src="http://code.jquery.com/jquery-latest.min.js"></script>
		<script src="${pageContext.request.contextPath}/resources/assets/js/jquery.min.js"></script>
		<script src="${pageContext.request.contextPath}/resources/assets/js/jquery.scrollex.min.js"></script>
		<script src="${pageContext.request.contextPath}/resources/assets/js/jquery.scrolly.min.js"></script>
		<script src="${pageContext.request.contextPath}/resources/assets/js/browser.min.js"></script>
		<script src="${pageContext.request.contextPath}/resources/assets/js/breakpoints.min.js"></script>
		<script src="${pageContext.request.contextPath}/resources/assets/js/util.js"></script>
		<script src="${pageContext.request.contextPath}/resources/assets/js/main.js"></script>
	</body>
	
	
	<!-- 지도,년도별 범죄 script -->
	<script>
		var obj = {"type":"FeatureCollection","crs":{"type":"name","properties":{"name":"urn:ogc:def:crs:OGC:1.3:CRS84"}}, "features": [
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.03230717815228,35.116426813094044],[129.0377898017917,35.112085659297485],[129.0415969093064,35.110967823431054],[129.04123316953226,35.10773213307311],[129.0377407768578,35.10351833738488],[129.0382080730652,35.09760803464848],[129.03687531894596,35.09657732478243],[129.02638912568588,35.09567543431464],[129.02168178393376,35.10175508523125],[129.02274528311605,35.10896418600405],[129.0275200132412,35.10992714313046],[129.0282573032963,35.11545278271957],[129.03230717815228,35.116426813094044]]]},"properties":{"SIG_CD":"26110","SIG_ENG_NM":"Jung-gu","SIG_KOR_NM":"중구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.02349567319604,35.07578017870069],[129.02057102882017,35.077735263773036],[129.01740654059986,35.07389122631511],[129.02127970659913,35.069671259512425],[129.02030265101632,35.064506472005114],[129.0222863203527,35.06192830246726],[129.01583951978006,35.05719709113842],[129.01500570214802,35.05275333006715],[129.0116466698036,35.052445606639026],[129.00828731029244,35.0627500750315],[129.0111268610293,35.062993260258885],[129.00550309169586,35.071087962860624],[129.00445134554494,35.07843967586199],[129.00777820154604,35.07886341551694],[129.011169390251,35.0767971936883],[129.01194781949502,35.084088322351135],[129.014364649723,35.09104978849369],[129.01419823051293,35.09377213631602],[129.00736987105702,35.101259053047045],[129.01046237899297,35.10569483284032],[129.00350378841486,35.111245337514575],[129.00270509824836,35.11726400344935],[128.9989946751535,35.11854434221623],[129.00001500347213,35.12369167001823],[129.0030263691267,35.1254492396054],[129.00269745296376,35.13371926310332],[129.00447507613592,35.13914084050122],[129.01057609155737,35.13883409036915],[129.0157382731088,35.1361430093072],[129.02244813899821,35.13679105521334],[129.02626010766644,35.133004600471],[129.0246537675203,35.11788912579425],[129.02806155095345,35.11239292178042],[129.02134495781138,35.105672073037354],[129.0216817828631,35.10175508814183],[129.02638912487822,35.09567543752825],[129.02522273228882,35.09351168420079],[129.02654403245555,35.085486569984276],[129.02349567319604,35.07578017870069]]]},"properties":{"SIG_CD":"26140","SIG_ENG_NM":"Seo-gu","SIG_KOR_NM":"서구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.04264226677017,35.14589414794872],[129.0463840147511,35.14566742481765],[129.05163856672604,35.142276267257095],[129.0645315865149,35.141413887982594],[129.06613139576731,35.138691043355486],[129.0658658650626,35.129818299273644],[129.06463749146118,35.12721684662798],[129.05597897109285,35.11830729926215],[129.0546234855882,35.12596945802125],[129.04997057409486,35.12352861555773],[129.04247060263262,35.11029948147148],[129.03778980191893,35.1120856633403],[129.0320441491731,35.116558509900315],[129.02672497587034,35.115619768946516],[129.02430861494983,35.11881761244171],[129.02554463725121,35.125649650811724],[129.0257066131822,35.13566821110662],[129.03199463727464,35.13778505358252],[129.03516576626862,35.13770300015002],[129.0387440331257,35.140297935158436],[129.03912971408755,35.14403845021531],[129.04264226677017,35.14589414794872]]]},"properties":{"SIG_CD":"26170","SIG_ENG_NM":"Dong-gu","SIG_KOR_NM":"동구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.0709335391821,35.05859618439158],[129.06948732289231,35.06069789920497],[129.06451599831087,35.0624785286019],[129.06545081868316,35.068525260777115],[129.0568700917853,35.07054812729384],[129.04687242396858,35.075624651504945],[129.04094375049445,35.08119685246674],[129.03415467016478,35.08537248030702],[129.03162988535507,35.094017447299635],[129.04548701060997,35.097103705389436],[129.0512023152384,35.09961679642082],[129.05882100143876,35.10053274938582],[129.06837834227474,35.09594612572671],[129.07924571642678,35.08477404073561],[129.07878111260786,35.081796665339255],[129.08440563566083,35.07365777649178],[129.08736947529653,35.076892216973505],[129.09268505761028,35.08016202695931],[129.09474504068956,35.076603242165824],[129.09102720123167,35.07416570125089],[129.0859000864788,35.074254045354394],[129.07985548271202,35.07142556440899],[129.0845308840733,35.069660781656104],[129.08545781910328,35.06567934790803],[129.09075181730802,35.060963207396746],[129.09621032505245,35.0597582251983],[129.09192967622678,35.05352421037236],[129.09173775117958,35.05119223657391],[129.08632122310345,35.04932329599533],[129.08284388440592,35.05045070748398],[129.0818878045835,35.05595439414773],[129.07744274142178,35.06070565975822],[129.0709335391821,35.05859618439158]]]},"properties":{"SIG_CD":"26200","SIG_ENG_NM":"Yeongdo-gu","SIG_KOR_NM":"영도구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.06517559049553,35.17703084184649],[129.06718207032551,35.176382499408426],[129.0702555514391,35.17578855978395],[129.07309061421134,35.17905872571829],[129.0785543685622,35.175441047403375],[129.08197538745367,35.17149089630585],[129.08130232432853,35.16763355830437],[129.07809380596723,35.164372666933794],[129.08283185555632,35.15817376401986],[129.0786679530962,35.15054094367159],[129.0750411046896,35.150570286611206],[129.06678607456027,35.14774932996108],[129.0630007927672,35.14869765508705],[129.06323299604693,35.143632009709684],[129.05909955253222,35.14129943173317],[129.05163856659348,35.14227626321211],[129.04638401462006,35.14566742077224],[129.04119373270566,35.14612890851602],[129.0387440329971,35.14029793111326],[129.03516576614126,35.13770299610496],[129.03199463714822,35.13778504953733],[129.0257066130577,35.13566820706144],[129.02244813983233,35.13679105226461],[129.01573827404564,35.136143006314406],[129.01215834863925,35.13745819625192],[129.0162387125029,35.143331357940646],[129.01621909648304,35.15482818315661],[129.01058929279162,35.15874053186264],[129.01322434147633,35.16592864438377],[129.0105030669598,35.17316230411266],[129.01689299359413,35.17955223876673],[129.0210709979631,35.18203023441576],[129.02108501012785,35.1874751330795],[129.0255613056378,35.191736649345024],[129.02554440486787,35.19406966246433],[129.0324345425536,35.19590710134068],[129.03424237135206,35.198090369326145],[129.04397389086307,35.19924760475036],[129.04825560999592,35.19454729024844],[129.04759470180195,35.19046425684486],[129.05130241024773,35.18488337180047],[129.06000845230955,35.184347740638266],[129.06176413807634,35.18315707762725],[129.06260505746118,35.1773520037971],[129.06517559049553,35.17703084184649]]]},"properties":{"SIG_CD":"26230","SIG_ENG_NM":"Busanjin-gu","SIG_KOR_NM":"부산진구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.08276873371324,35.223768628521874],[129.082870303276,35.22370085119911],[129.08725945746218,35.22185917430764],[129.0859879135564,35.21898474910808],[129.09435890652304,35.215440848984464],[129.09453460570276,35.215481175466394],[129.10135421515355,35.21273495280807],[129.1063501183926,35.20954077961322],[129.11024005395978,35.210137373793984],[129.11083645603566,35.203972746375086],[129.11637030821288,35.20091918048156],[129.11431327026054,35.193638396220166],[129.11545694377727,35.18650038174034],[129.11517726660324,35.183542763071145],[129.11150622264188,35.18893578932474],[129.10012311150098,35.191406374383],[129.09662238972191,35.192797182702534],[129.08745469070942,35.19353407054997],[129.08189244337996,35.19821592347478],[129.07778658781837,35.199390326037395],[129.07187526578804,35.19523871521182],[129.06436358233623,35.19371953364267],[129.06220979926874,35.191692713100366],[129.05725926734561,35.19338051219675],[129.0526136806555,35.19229203871056],[129.04828882307677,35.19452012317064],[129.044128759719,35.19946127212926],[129.04421659562658,35.20172168898531],[129.05001260984696,35.206618385407886],[129.051229597595,35.212990616240475],[129.0558118853567,35.217702111492244],[129.05889580578145,35.22478247076246],[129.06176727155946,35.225841740931465],[129.06833104319506,35.224782339636604],[129.07799824783783,35.22611513705339],[129.08276873371324,35.223768628521874]]]},"properties":{"SIG_CD":"26260","SIG_ENG_NM":"Dongnae-gu","SIG_KOR_NM":"동래구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.1112151885433,35.135751649933155],[129.11046675557642,35.134233572839754],[129.1172310659722,35.13022519485844],[129.12050595460226,35.13387251552228],[129.12252419695065,35.12608281109722],[129.12831632091317,35.118505543936514],[129.12703595414896,35.11337807924282],[129.12800802705414,35.110772187538764],[129.12532465972262,35.1061508634324],[129.12339506334428,35.0994377196051],[129.11610301963336,35.100301147905654],[129.11298092239636,35.10315240405799],[129.11041166651415,35.101081532890504],[129.10749735175372,35.10337356161011],[129.10484879046945,35.09921157758618],[129.0956443100291,35.09675831838176],[129.0937915602162,35.1073327360533],[129.09034896755824,35.108759489252236],[129.09034337896944,35.10361270282404],[129.07498808407541,35.103613930933115],[129.06737995534394,35.108161248898575],[129.06841462292925,35.11242412555006],[129.07179619941007,35.11610875261819],[129.07303018965882,35.12216514886887],[129.06562544027767,35.12297161482417],[129.06681270690953,35.12565697075257],[129.06564977885455,35.13983597807235],[129.06334784067502,35.143145122422815],[129.06300106981502,35.148697658290835],[129.06678635124984,35.147749332865615],[129.07504138122638,35.15057028968758],[129.0786682297948,35.15054094679175],[129.08196743830572,35.15727648719933],[129.0890995500776,35.16074175368043],[129.09540579293298,35.16131846390547],[129.10120468676368,35.15185356489944],[129.1033635089788,35.14392485233452],[129.10220184484098,35.1426269320913],[129.1112151885433,35.135751649933155]]]},"properties":{"SIG_CD":"26290","SIG_ENG_NM":"Nam-gu","SIG_KOR_NM":"남구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.0474985246299,35.274213578571214],[129.04351310184967,35.269728880424694],[129.04179979150604,35.26332741517198],[129.03656426873456,35.260714703046766],[129.04231165169554,35.25747877304335],[129.0485499480673,35.25525595411674],[129.0453466644217,35.251436031610034],[129.0481642861532,35.246103018040685],[129.04898695064637,35.24541365770578],[129.05037139527755,35.24125338346423],[129.04726354697897,35.23789273447925],[129.04432468986926,35.230679824640454],[129.0489351297519,35.22864780717653],[129.05555259971513,35.22809549848889],[129.0604583469193,35.22982090373292],[129.06176727155946,35.225841740931465],[129.05889580578145,35.22478247076246],[129.0558118853567,35.217702111492244],[129.051229597595,35.212990616240475],[129.05001260984696,35.206618385407886],[129.04421659562658,35.20172168898531],[129.044128759719,35.19946127212926],[129.0342426480285,35.1980903725437],[129.03243481920256,35.195907104228],[129.02554468179926,35.19406966548799],[129.02556158268175,35.19173665256651],[129.02087437744552,35.18763002258187],[129.0171984122812,35.188823503392115],[129.00790513535293,35.18812570981391],[129.00407170792175,35.190334234989955],[128.99082871486573,35.195623029159634],[128.9869629510161,35.202019161657276],[128.99119445630396,35.20442067810487],[128.99535985904316,35.21269447528662],[128.99822457322148,35.232913435555176],[128.99676037754372,35.236080511888204],[128.99880300028272,35.23808216014863],[129.00218230548893,35.24529289311992],[129.01162338162777,35.26331929458912],[129.01481782167696,35.270529731905434],[129.0134829350897,35.27375792482371],[129.01712048052443,35.275459531560024],[129.03068288885984,35.276878027131744],[129.03590801931486,35.27547020445963],[129.0474985246299,35.274213578571214]]]},"properties":{"SIG_CD":"26320","SIG_ENG_NM":"Buk-gu","SIG_KOR_NM":"북구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.1266550838745,35.16572027233498],[129.12541142094778,35.16697891227194],[129.1245458693218,35.16804800663825],[129.12405963721525,35.169594248148265],[129.1229990765926,35.171475106279836],[129.1228029399293,35.17189897472738],[129.1227789938745,35.17200669232475],[129.12253236516636,35.17230881108936],[129.12149615089382,35.17300393793429],[129.12137549248064,35.1731122197437],[129.12114563780076,35.173360544344845],[129.12081697724483,35.173964567440926],[129.11545694377727,35.18650038174034],[129.11431327026054,35.193638396220166],[129.11637030821288,35.20091918048156],[129.11083645603566,35.203972746375086],[129.11024005395978,35.210137373793984],[129.11222433870586,35.21250995656866],[129.11917010806428,35.21581576027606],[129.1168126079485,35.22231674947177],[129.120695030903,35.22593644788266],[129.12701298766362,35.22712890184134],[129.13047566189348,35.23129983525339],[129.13103021835383,35.23534039765803],[129.13690024766427,35.23767745362202],[129.1415779258139,35.242498789103635],[129.14460594239475,35.25096790639628],[129.14863785341635,35.24605973083043],[129.1563748171719,35.24425634233929],[129.15538649353783,35.23588416325942],[129.1610360910157,35.234488788032635],[129.1690420038844,35.2277674057508],[129.16854081375766,35.22453683478394],[129.16519741482034,35.219710142332545],[129.16489730272147,35.2151272162447],[129.1603825327266,35.21189745808618],[129.16009717147057,35.20638157328965],[129.1696620517253,35.20090647252045],[129.17214626492395,35.20215590542178],[129.17915441187878,35.19795453038166],[129.183375676701,35.19762830205964],[129.1854459981092,35.19543488942249],[129.183294895238,35.19101702364194],[129.18816054180502,35.189252016871656],[129.19316750417587,35.193980799917405],[129.1948417666948,35.19852989997549],[129.19895111197394,35.19964090264545],[129.20692720655518,35.196851607925424],[129.2064086529518,35.19148936664207],[129.20760605277607,35.18293362187797],[129.20057147030332,35.17970040413516],[129.19746581265147,35.17558637814515],[129.1979320980556,35.17313389346812],[129.19624137136645,35.16392487790488],[129.1937644093366,35.16081917613669],[129.18686860058878,35.159450746743815],[129.18093167857606,35.1548538219808],[129.1768940066309,35.15537346264565],[129.17019618945025,35.15912361379902],[129.16565306500092,35.159589555686715],[129.15538637171176,35.157205477785226],[129.1528194887947,35.151881713671266],[129.14272736201977,35.15449884452281],[129.14204296489464,35.15855565563541],[129.13705192671847,35.160283003364626],[129.12781924435114,35.166124636589146],[129.1266550838745,35.16572027233498]]]},"properties":{"SIG_CD":"26350","SIG_ENG_NM":"Haeundae-gu","SIG_KOR_NM":"해운대구"}},
				{"type":"Feature","geometry":{"type":"MultiPolygon","coordinates":[[[[128.94405396285217,35.05924524097673],[128.93626268721636,35.05509124358726],[128.9345786428924,35.05928753073743],[128.94405396285217,35.05924524097673]]],[[[128.95892447427525,35.11815697904595],[128.96368680711032,35.121938421940285],[128.97588868462066,35.11706436103256],[128.9800557771744,35.11712353984692],[128.98694682280026,35.124222912159055],[128.9899397013428,35.124595981610504],[128.99975757507414,35.12325899562968],[128.9989949529732,35.11854434221604],[129.00270537606843,35.117264003449165],[129.00350406623502,35.11124533751439],[129.01046265681393,35.105694832840065],[129.00737014887767,35.10125905304682],[129.01419850833434,35.09377213631576],[129.0143649275444,35.09104978849343],[129.0119480973173,35.08408833136456],[129.01116967903653,35.07679719368717],[129.00777847936678,35.078863415516736],[129.00445162336524,35.078439675861766],[129.00263313498956,35.08466262679637],[128.99731189653318,35.08306233054069],[128.99304733436293,35.08393930235941],[128.9926242458281,35.08013468444164],[128.99494294975528,35.07574556832428],[128.99532727360105,35.06338236226841],[129.00127620581296,35.04816608088131],[128.99542389500726,35.04534133852451],[128.99252986842742,35.04896391877504],[128.98842572589743,35.058031097125664],[128.98501424643118,35.05995972364626],[128.97810280643736,35.05715597870402],[128.9756652867637,35.05268876054919],[128.98048471233272,35.05279537430555],[128.98175241950858,35.04891830148101],[128.9756653438738,35.04810987470908],[128.9720727680072,35.04909708804606],[128.96942268262214,35.04519347733537],[128.9740656674983,35.0424815095356],[128.96947561175077,35.03733608036097],[128.96725242577935,35.040082454287045],[128.96909072402877,35.044731084485946],[128.9669633878997,35.047727542780954],[128.95816384607326,35.05064506832825],[128.95077469453426,35.08000683085705],[128.9513672806311,35.0854148524134],[128.95461991703308,35.09224966582881],[128.9564943476877,35.10586112607067],[128.94866144857767,35.10714652189637],[128.94736024610006,35.09897437675949],[128.94378973820443,35.08817246999766],[128.93835447777226,35.0885385221627],[128.9344377037289,35.08662645461433],[128.93397785679647,35.09285297585035],[128.9366302151865,35.101289163983296],[128.93639600269194,35.1045005603462],[128.9393294511386,35.10885824097858],[128.93486387738645,35.111900672894684],[128.9381633056938,35.11411841102603],[128.94150682891103,35.11859282764589],[128.94778287307116,35.12269718500932],[128.95126319286757,35.129018228067004],[128.95674577583117,35.13510957747426],[128.96195760204713,35.1352658531575],[128.95746340146664,35.124308470468215],[128.95892447427525,35.11815697904595]]]]},"properties":{"SIG_CD":"26380","SIG_ENG_NM":"Saha-gu","SIG_KOR_NM":"사하구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.14460594239475,35.25096790639628],[129.1415779258139,35.242498789103635],[129.13690024766427,35.23767745362202],[129.13103021835383,35.23534039765803],[129.13047566189348,35.23129983525339],[129.12701298766362,35.22712890184134],[129.120695030903,35.22593644788266],[129.1168126079485,35.22231674947177],[129.11917010806428,35.21581576027606],[129.11222433870586,35.21250995656866],[129.11024005395978,35.210137373793984],[129.1063501183926,35.20954077961322],[129.10135421515355,35.21273495280807],[129.09453460570276,35.215481175466394],[129.09435890652304,35.215440848984464],[129.0859879135564,35.21898474910808],[129.08725945746218,35.22185917430764],[129.082870303276,35.22370085119911],[129.08276873371324,35.223768628521874],[129.07799824783783,35.22611513705339],[129.06833104319506,35.224782339636604],[129.06176727155946,35.225841740931465],[129.0604583469193,35.22982090373292],[129.05555259971513,35.22809549848889],[129.0489351297519,35.22864780717653],[129.04432468986926,35.230679824640454],[129.04726354697897,35.23789273447925],[129.05037139527755,35.24125338346423],[129.04898695064637,35.24541365770578],[129.0481642861532,35.246103018040685],[129.0453466644217,35.251436031610034],[129.0485499480673,35.25525595411674],[129.04231165169554,35.25747877304335],[129.03656426873456,35.260714703046766],[129.04179979150604,35.26332741517198],[129.04351310184967,35.269728880424694],[129.0474985246299,35.274213578571214],[129.04728081001366,35.276001951308096],[129.05386887903887,35.282867419257535],[129.05216710434632,35.28586062627317],[129.05349915387381,35.288996673092484],[129.05894500094064,35.29497908141163],[129.0705541098376,35.29452232066996],[129.07360693430735,35.290843109531785],[129.0905505826284,35.303423399519346],[129.09909415314377,35.30402072393524],[129.10621111218288,35.3064573625617],[129.1085619756285,35.30458063946515],[129.1164523127332,35.30177017646473],[129.12125191388506,35.302103589654486],[129.12953069949603,35.298268883068054],[129.13215338771795,35.2918801708049],[129.12820844358546,35.28932452426039],[129.1256428246864,35.282725777435886],[129.12606463577828,35.27849713911746],[129.12478231224082,35.273721430273405],[129.12071727856758,35.267289944401696],[129.1225773221392,35.261839567148044],[129.12943023502288,35.26033793979064],[129.13779028800033,35.260570449390876],[129.13957966334016,35.25962658371218],[129.13827398718823,35.254292163136],[129.14460594239475,35.25096790639628]]]},"properties":{"SIG_CD":"26410","SIG_ENG_NM":"Geumjeong-gu","SIG_KOR_NM":"금정구"}},
				{"type":"Feature","geometry":{"type":"MultiPolygon","coordinates":[[[[128.91791961925358,35.056980118896476],[128.908406018964,35.05863613409553],[128.91040479152727,35.062339845572986],[128.91857581376263,35.060761184515364],[128.91791961925358,35.056980118896476]]],[[[128.8912944394121,35.06115212987209],[128.89741803360337,35.061077763842356],[128.9068392451312,35.05698775910238],[128.91681371695924,35.054273592001635],[128.91622942567454,35.05200364877445],[128.9083370126943,35.055110732614764],[128.8916559513,35.05904420851956],[128.8912944394121,35.06115212987209]]],[[[128.86192694946172,35.06981192248951],[128.8719262108433,35.06925169675741],[128.88576607933064,35.06743186836538],[128.88510428886062,35.06504693567708],[128.8810903910718,35.063913415762585],[128.8741168957197,35.06383506200222],[128.8603835444657,35.068637359041404],[128.86192694946172,35.06981192248951]]],[[[128.83812271674128,35.074793521194444],[128.84216372785846,35.06951762373306],[128.84950408817954,35.06838732373215],[128.85499712532146,35.068958812383364],[128.85640448083194,35.0643984642764],[128.8480050918294,35.06242570820568],[128.84229717099475,35.064187758730434],[128.83660190267753,35.06834684343548],[128.83812271674128,35.074793521194444]]],[[[128.82865581061478,35.08993281391549],[128.83520144504033,35.08621229731104],[128.83511202251546,35.062628677247936],[128.83269991513185,35.05761129377122],[128.83770577115237,35.05345959393863],[128.84200232215147,35.05399827808079],[128.84642706100874,35.05638078842528],[128.8505919346158,35.05031149903893],[128.8508995781571,35.04208298577131],[128.847873744346,35.0358559413475],[128.8438442586501,35.03338465592946],[128.84170484893323,35.02944038060866],[128.84312061894658,35.02438955816776],[128.83477401272881,35.01594874490785],[128.83409425409508,35.01160381023498],[128.83974047194354,35.00841139655164],[128.83629777624836,34.99727304019358],[128.82910397711944,34.98909276649218],[128.82959899330092,34.99551128466215],[128.82233207984564,34.997340494893095],[128.82223587627183,35.00157457395531],[128.8239758383256,35.006821069961546],[128.82098849424705,35.00910787452776],[128.82691385869137,35.01071062138631],[128.82733715722205,35.01352158356623],[128.8131357135588,35.02030085221601],[128.81207323900907,35.02338084375454],[128.81562331117917,35.02803225307682],[128.81335385911342,35.03042372339485],[128.8096299491495,35.03028456401607],[128.81267927719332,35.03764012516826],[128.81176023254045,35.04100756772317],[128.80747928896133,35.04386968395743],[128.80500433904777,35.048070973445505],[128.79978765119785,35.04832347080028],[128.7973847482582,35.053727236787395],[128.80534432750522,35.05554194698217],[128.80751118847536,35.05855397342422],[128.81196868141598,35.06039441700824],[128.82179960215603,35.06081065356378],[128.82133546894224,35.0639491232907],[128.806291383901,35.06144763458993],[128.8049874208063,35.066747914835716],[128.83238943333953,35.07130342529868],[128.83238156016728,35.074908881114695],[128.83513752210385,35.07761724041109],[128.81151489643471,35.07758040845819],[128.81150291124595,35.082988829875724],[128.81852749269137,35.08300143027094],[128.82153770036353,35.08584640377494],[128.82643222925856,35.08621402124863],[128.82865581061478,35.08993281391549]]],[[[128.9976103165331,35.22825055562364],[128.995359581298,35.21269447529232],[128.99119716101325,35.20442189878951],[128.97706960290628,35.19332833233672],[128.96632033680194,35.18789953575136],[128.96329105060934,35.18364154715264],[128.96288535045755,35.16438439289854],[128.96063704152527,35.15422361812875],[128.95964057440912,35.13664648044968],[128.95674549807995,35.13510957747343],[128.95126291511698,35.129018228078266],[128.94778259533098,35.12269718502992],[128.94150655118153,35.11859282765278],[128.93816302793925,35.11411841104638],[128.93274442651048,35.110511284815416],[128.93301707513123,35.10776536616535],[128.92972659027035,35.10164813964216],[128.93108830308753,35.09758786948722],[128.9262453856878,35.093022463431055],[128.91598707604407,35.089303171522516],[128.912211367483,35.086397821060686],[128.91111228184877,35.07905055711401],[128.89537836706944,35.07903726925393],[128.89536832274481,35.08638289836591],[128.898455725181,35.0950690386422],[128.90049173581,35.10412303723546],[128.9005870876715,35.11126013113744],[128.90563213053437,35.11810168908912],[128.89762447787567,35.12029070246458],[128.89300981482216,35.11176219355837],[128.88947148031082,35.107837480951005],[128.8878345296247,35.0902068230811],[128.8832172909079,35.082321834979716],[128.8801407257227,35.07966242584994],[128.87031238883475,35.08078424216345],[128.8683369630685,35.0834291506421],[128.83760727391387,35.08339068534904],[128.8353339297796,35.088389058807394],[128.83211056104298,35.08840821668273],[128.82450841159823,35.09454016758615],[128.82187820565682,35.097733860630214],[128.82346855047444,35.101877135375666],[128.8315865370352,35.10264717606262],[128.8339220067421,35.10180741645888],[128.84170076186248,35.10598958031976],[128.84296248064697,35.11315835850365],[128.83848878301714,35.115203968582264],[128.83637175121655,35.12002199383767],[128.83818731765928,35.12308843442593],[128.83297530985382,35.12994098534958],[128.82979294133557,35.12821818867761],[128.8179497784515,35.13245300412905],[128.81535697555648,35.132634911297394],[128.80731620983872,35.13947956154806],[128.80715198733313,35.14214929620074],[128.80213258998907,35.14190154546813],[128.80199878430324,35.14605330328757],[128.79785564060626,35.15137870297496],[128.79430329238877,35.153913301389586],[128.79451966414038,35.15853793155103],[128.80059522825005,35.15806778642715],[128.80587167209995,35.16043761194417],[128.80870681893694,35.158939194683775],[128.81596562785936,35.16016205974656],[128.82299253495228,35.156158747400674],[128.83386377615776,35.15726687349539],[128.83600548182383,35.15913795359237],[128.84293309139431,35.157988705729366],[128.8462886417264,35.16468788849841],[128.85974323398528,35.16817075104597],[128.8673863644386,35.16771486392519],[128.87150013929562,35.16506246413973],[128.87209641547523,35.16261680023937],[128.86953643724752,35.15870585024325],[128.86526756344335,35.15817232006012],[128.87166285499245,35.15046485671938],[128.87469454854758,35.15360077287825],[128.87534341949444,35.15928640340217],[128.88147009371065,35.159584050172725],[128.87603808830076,35.16554301613432],[128.87712466497052,35.16986260851608],[128.87235365719374,35.17227428989463],[128.8734788335342,35.174137857792516],[128.88043426206886,35.17152975833807],[128.88027117799666,35.18030083860703],[128.88141714947162,35.182815812567476],[128.87588402561224,35.1884540371642],[128.8761937048485,35.1926306082472],[128.87035480986447,35.2015587152961],[128.8743453338906,35.20446771479872],[128.87898763164418,35.20999454846436],[128.88161795947263,35.2103892372518],[128.8860685136815,35.21439886476562],[128.889084504289,35.21479921397095],[128.8966122542704,35.21314239420325],[128.90466799249052,35.21530132712001],[128.90969418806873,35.215461001361525],[128.90501825849583,35.2200730531689],[128.9094822027199,35.2230580324352],[128.91250327243526,35.222515137339606],[128.9166529896062,35.21696081353062],[128.9201279677629,35.21642265912194],[128.92923950477623,35.22003168346997],[128.93979638012448,35.22724985880204],[128.94399780475823,35.22832542686448],[128.94853474671342,35.225242047502355],[128.95669620874952,35.22525197300003],[128.97357792187898,35.22736078423158],[128.9841578139148,35.22975593564125],[128.9897009679452,35.231676265059455],[128.9967601000832,35.23608051211647],[128.9982242957485,35.23291343579086],[128.9976103165331,35.22825055562364]]]]},"properties":{"SIG_CD":"26440","SIG_ENG_NM":"Gangseo-gu","SIG_KOR_NM":"강서구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.06718207032551,35.176382499408426],[129.06517559049553,35.17703084184649],[129.06260505607213,35.177352002864794],[129.06176413699268,35.183157076527486],[129.06000845142992,35.18434773996092],[129.05130240916418,35.18488337074461],[129.04759470040756,35.190464255956385],[129.04825560881596,35.19454728952272],[129.05261340272977,35.19229203465819],[129.0572589894185,35.193380508144436],[129.06220952134026,35.191692709048304],[129.06436330440698,35.19371952959055],[129.07187498785652,35.19523871115976],[129.07778630988494,35.19939032198513],[129.08189216544534,35.19821591942277],[129.08745441277327,35.19353406649853],[129.0966221117829,35.192797178651446],[129.10012283356087,35.191406370332146],[129.1115059446982,35.188935785274424],[129.11517698865853,35.183542759021385],[129.1113785290164,35.175875358554705],[129.10734102022795,35.1778438217305],[129.1062467545903,35.18043167986464],[129.09745160257196,35.17942951941316],[129.0953203944786,35.1684706882829],[129.09155204064461,35.165481037557285],[129.09360083486777,35.16199129196952],[129.08282943041553,35.15818633879484],[129.07809380499074,35.16437266583411],[129.08130232349708,35.167633557583144],[129.08197538653084,35.171490895373445],[129.078554367634,35.1754410464709],[129.07309061302575,35.17905872466271],[129.0702555500446,35.17578855885171],[129.06718207032551,35.176382499408426]]]},"properties":{"SIG_CD":"26470","SIG_ENG_NM":"Yeonje-gu","SIG_KOR_NM":"연제구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.12081697724483,35.173964567440926],[129.12114563780076,35.173360544344845],[129.12137549248064,35.1731122197437],[129.12149615089382,35.17300393793429],[129.12253236516636,35.17230881108936],[129.1227789938745,35.17200669232475],[129.1228029399293,35.17189897472738],[129.1229990765926,35.171475106279836],[129.12405963721525,35.169594248148265],[129.1245458693218,35.16804800663825],[129.12541142094778,35.16697891227194],[129.1266550838745,35.16572027233498],[129.13471135136643,35.156913858638894],[129.1338202619881,35.15485537470558],[129.12446291850523,35.15289179091764],[129.11965786721916,35.154216825293155],[129.11442402460824,35.147281540358236],[129.1177143512459,35.14603459212147],[129.11758505026975,35.13994156069878],[129.1112151885433,35.135751649933155],[129.10220184484098,35.1426269320913],[129.1033635089788,35.14392485233452],[129.10120468676368,35.15185356489944],[129.09540579293298,35.16131846390547],[129.09155231858108,35.1654810416062],[129.09532067241636,35.168470692331965],[129.09745188051082,35.17942952346308],[129.106247032532,35.1804316839144],[129.10734129816984,35.17784382577997],[129.11137880695958,35.17587536260391],[129.11517726660324,35.183542763071145],[129.11545694377727,35.18650038174034],[129.12081697724483,35.173964567440926]]]},"properties":{"SIG_CD":"26500","SIG_ENG_NM":"Suyeong-gu","SIG_KOR_NM":"수영구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[128.99093815176397,35.19384804652697],[128.99458507970968,35.194108113012746],[129.00790485760444,35.18812570981634],[129.01719813453275,35.18882350339463],[129.0208740996973,35.18763002258455],[129.02107099704824,35.18203023754221],[129.01689299283885,35.1795522418887],[129.01050306578472,35.173162307445445],[129.01322434025363,35.165928647337346],[129.0105892921308,35.15874053507108],[129.0162190956145,35.15482818627653],[129.0162387117466,35.14333136118715],[129.01215834742652,35.13745819950237],[129.00167709664095,35.14071836307678],[129.00432154594264,35.13640072373231],[129.00269745303555,35.13371926310576],[129.00302636919838,35.1254492396079],[128.99975181195484,35.123258941474404],[128.98993942359453,35.12459598161317],[128.98694654505186,35.124222912161706],[128.98005549942593,35.11712353984941],[128.97588840687234,35.11706436103523],[128.96368652936195,35.1219384219429],[128.95818643630486,35.11886618847208],[128.95746312371816,35.12430847047076],[128.96195732429862,35.13526585316006],[128.95963951592898,35.13664147303748],[128.96063704150595,35.1542236181392],[128.96288535046443,35.164384392882425],[128.96329105059365,35.18364154713485],[128.9663203368085,35.18789953573547],[128.97706960289778,35.19332833233562],[128.98773002547858,35.20145511839938],[128.98788721890082,35.19590140598298],[128.99093815176397,35.19384804652697]]]},"properties":{"SIG_CD":"26530","SIG_ENG_NM":"Sasang-gu","SIG_KOR_NM":"사상구"}},
				{"type":"Feature","geometry":{"type":"Polygon","coordinates":[[[129.28816360189626,35.32116393822749],[129.28498822104362,35.3262159981891],[129.27843195281437,35.3260508216936],[129.26819220395734,35.32192499941399],[129.26440999585293,35.31921409338049],[129.26174727515368,35.3152630496167],[129.2608055485733,35.30966780083334],[129.25786825970206,35.305744319756364],[129.2611598681173,35.2967059162827],[129.2597222999507,35.290570941434595],[129.25720121700843,35.28937743530709],[129.25999517990334,35.28306220934726],[129.2555586916101,35.28089942178125],[129.25515428860336,35.27457290234036],[129.2532990600247,35.27180967921098],[129.24685317760816,35.27181503923528],[129.24352945273512,35.27013707461441],[129.24312614226355,35.26587255876765],[129.2356944729062,35.26501279585708],[129.23357310332193,35.261051045341254],[129.2348290730715,35.25838971960538],[129.2388368531328,35.25730035473067],[129.24153439083992,35.25908868619437],[129.24516884164322,35.258107967414524],[129.25217267552222,35.25938258076526],[129.2511728714247,35.255878417805015],[129.253083451747,35.246576000641355],[129.2471868939126,35.242258314004694],[129.2477937192143,35.239444881020375],[129.2428101202284,35.237156547360954],[129.2440934876562,35.2315454765426],[129.24050239473425,35.22944563476753],[129.23949536021425,35.223120149343366],[129.23556432487498,35.21973884495848],[129.23082308688026,35.22048796947769],[129.22203634517092,35.213094291505676],[129.22282937068098,35.20991104195256],[129.22635770661412,35.20694814456098],[129.22999716276087,35.20076710910279],[129.22995711352408,35.198171359486565],[129.22495857816133,35.19338541167736],[129.22301579262512,35.18951316698671],[129.22381872579578,35.18599645327022],[129.21914808228283,35.18431041011322],[129.21693791964583,35.187297827856916],[129.21321203172465,35.185735214776564],[129.2119369778174,35.18256043211656],[129.2076057749425,35.182933621896346],[129.2064083751255,35.191489366641164],[129.20692692869898,35.19685160793888],[129.1989508341313,35.19964090265936],[129.19484148884118,35.19852989997139],[129.19316722634502,35.193980799920496],[129.18816026397133,35.189252016882136],[129.18329461739674,35.19101702363776],[129.18544572026724,35.19543488941832],[129.18337539885473,35.19762830207753],[129.17915413405095,35.19795453038113],[129.17214598709842,35.20215590543586],[129.16966177387286,35.200906472523634],[129.16009689363338,35.206381573307375],[129.16038225489368,35.21189745809644],[129.1648970248878,35.215127216255226],[129.16519713697573,35.2197101423337],[129.16854053591234,35.22453683478512],[129.16904172603895,35.227767405751976],[129.16103581317185,35.23448878803377],[129.15538621569513,35.235884163260515],[129.15637453932902,35.244256342340385],[129.1486375755749,35.24605973083147],[129.14706126624276,35.24943258062841],[129.13827370934877,35.25429216313698],[129.1395793855004,35.259626583713135],[129.13779001016093,35.26057044939184],[129.12942995718498,35.26033793979154],[129.1225770443025,35.26183956714892],[129.12071700073122,35.26728994440255],[129.1247820344037,35.27372143027428],[129.12606435794095,35.278497139118386],[129.12564254684912,35.282725777436816],[129.1282081657478,35.28932452426129],[129.13215310987954,35.29188017080585],[129.12953042165813,35.298268883068964],[129.12125163604855,35.302103589655346],[129.11645203489752,35.301770176465574],[129.10856169779416,35.304580639465925],[129.11240652953947,35.3101382951039],[129.11217552569673,35.317350501448764],[129.11366302848074,35.32022304118671],[129.11864877027997,35.32309361819039],[129.12106574318753,35.32874256055758],[129.125337144101,35.33141514307724],[129.12402724911885,35.338077320435154],[129.1284248647386,35.343706058727626],[129.12738308931708,35.34576219122356],[129.13467721519467,35.352919886086234],[129.13323074754433,35.35635558336398],[129.12703487382794,35.362400999359735],[129.1233392097469,35.36323402801556],[129.12059246757215,35.36658597755589],[129.12757128971967,35.36772730823452],[129.13352078908576,35.365593803061344],[129.14875820712385,35.36425130918561],[129.15911529915732,35.360272381922385],[129.16280556259522,35.3568064181651],[129.17434695907957,35.35171593955864],[129.1781878429903,35.35177492863533],[129.18572667362997,35.35856754239702],[129.1933692578776,35.3612422596006],[129.19378110739925,35.36334068717286],[129.19876218824237,35.36649641735487],[129.19782792784576,35.371410062709344],[129.19918156909307,35.37597753619575],[129.19359451485155,35.382088579130844],[129.1993674402703,35.389037447667064],[129.20508994994296,35.38434107856995],[129.21156341739228,35.38077875965077],[129.21853600854393,35.378954790244904],[129.23019657184383,35.381141458723086],[129.23539953832378,35.38025729850284],[129.23701597467465,35.383561990876146],[129.2402208371561,35.38430375905231],[129.24680887444308,35.38274927879297],[129.25289677582793,35.386837834855605],[129.25846849236095,35.38420318517872],[129.2633377097983,35.38564393328699],[129.27234553022717,35.377214735751444],[129.27734390038057,35.371362858971075],[129.27942793221962,35.36613951102349],[129.28202809511478,35.36396134657736],[129.28051591857604,35.35622236946403],[129.28493080609758,35.350732055536575],[129.28388057478176,35.346083704218785],[129.27966214589662,35.34137064760927],[129.2855064455698,35.339220890984784],[129.28908589088397,35.34047426384264],[129.29099099436922,35.338009046470375],[129.2960122599706,35.3364737502578],[129.30366489405523,35.335616613279996],[129.3021834447313,35.33362837057029],[129.30481017110864,35.32955979778701],[129.3055029107792,35.324756875645676],[129.30409829283155,35.322166922967654],[129.3001288758986,35.32189085583349],[129.29921354043944,35.318556453847876],[129.28871314322276,35.319068615589195],[129.28816360189626,35.32116393822749]]]},"properties":{"SIG_CD":"26710","SIG_ENG_NM":"Gijang-gun","SIG_KOR_NM":"기장군"}}
				]};
			var areas = [];
			
			var obj1 = function(name,path){
				this.name = name; 
				this.path = path;
			}
			
			for(var i=0; i<obj.features.length; i++){
				var path1 = [];
				for(var j=0; j<obj.features[i].geometry.coordinates[0].length; j++){
					path1.push(new kakao.maps.LatLng(
							obj.features[i].geometry.coordinates[0][j][1],
							obj.features[i].geometry.coordinates[0][j][0]
								)
					);
				}
				var mapValue = new obj1(obj.features[i].properties.SIG_KOR_NM,path1);
				
				areas.push(mapValue);
			}
			
			// 지도에 폴리곤으로 표시할 영역데이터 배열입니다
		    	
			var mapContainer = document.getElementById('map'), // 지도를 표시할 div 
			    mapOption = { 
			        center: new kakao.maps.LatLng(35.205417, 129.078498), // 지도의 중심좌표
			        level: 10, // 지도의 확대 레벨
			        disableDoubleClickZoom: true
			    };
			
				
			var map = new kakao.maps.Map(mapContainer, mapOption),
			    customOverlay = new kakao.maps.CustomOverlay({}),
			    infowindow = new kakao.maps.InfoWindow({removable: true});
			    map.setDraggable(false);
			    map.setZoomable(false);
			
			// 지도에 영역데이터를 폴리곤으로 표시합니다 
			for (var i = 0, len = areas.length; i < len; i++) {
			    displayArea(areas[i]);
			    
			}
		
		// 다각형을 생상하고 이벤트를 등록하는 함수입니다
		function displayArea(area) {
		
		    // 다각형을 생성합니다 
		    var polygon = new kakao.maps.Polygon({
		        map: map, // 다각형을 표시할 지도 객체
		        path: area.path,
		        strokeWeight: 2,
		        strokeColor: '#004c80',
		        strokeOpacity: 0.8,
		        fillColor: '#fff',
		        fillOpacity: 0.7 
		    });
		
		    // 다각형에 mouseover 이벤트를 등록하고 이벤트가 발생하면 폴리곤의 채움색을 변경합니다 
		    // 지역명을 표시하는 커스텀오버레이를 지도위에 표시합니다
		    kakao.maps.event.addListener(polygon, 'mouseover', function(mouseEvent) {
		        polygon.setOptions({fillColor: '#09f'});
		
		        customOverlay.setContent('<div class="area">' + area.name + '</div>');
		        
		        customOverlay.setPosition(mouseEvent.latLng); 
		        customOverlay.setMap(map);
		    });
		
		    // 다각형에 mousemove 이벤트를 등록하고 이벤트가 발생하면 커스텀 오버레이의 위치를 변경합니다 
		    kakao.maps.event.addListener(polygon, 'mousemove', function(mouseEvent) {
		        
		        customOverlay.setPosition(mouseEvent.latLng); 
		    });
		
		    // 다각형에 mouseout 이벤트를 등록하고 이벤트가 발생하면 폴리곤의 채움색을 원래색으로 변경합니다
		    // 커스텀 오버레이를 지도에서 제거합니다 
		    kakao.maps.event.addListener(polygon, 'mouseout', function() {
		        polygon.setOptions({fillColor: '#fff'});
		        customOverlay.setMap(null);
		    }); 
		
		    // 다각형에 click 이벤트를 등록하고 이벤트가 발생하면 다각형의 이름과 면적을 인포윈도우에 표시합니다 
		    kakao.maps.event.addListener(polygon, 'click', function(mouseEvent) {
		
		    	if(area.name == '중구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "중구");
		    		    setHtml("2016_1", "6"); setHtml("2016_2", "12"); setHtml("2016_3", "39"); setHtml("2016_4", "864"); setHtml("2016_5", "801");
		    		    setHtml("2017_1", "0"); setHtml("2017_2", "8"); setHtml("2017_3", "39"); setHtml("2017_4", "658"); setHtml("2017_5", "446");
		    		    setHtml("2018_1", "0"); setHtml("2018_2", "0"); setHtml("2018_3", "0"); setHtml("2018_4", "0"); setHtml("2018_5", "0");
		    	}
		    	
				if(area.name == '동래구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "동래구");
		    		    setHtml("2016_1", "3"); setHtml("2016_2", "23"); setHtml("2016_3", "88"); setHtml("2016_4", "1137"); setHtml("2016_5", "1455");
		    		    setHtml("2017_1", "0"); setHtml("2017_2", "1"); setHtml("2017_3", "7"); setHtml("2017_4", "82"); setHtml("2017_5", "121");
		    		    setHtml("2018_1", "0"); setHtml("2018_2", "0"); setHtml("2018_3", "0"); setHtml("2018_4", "0"); setHtml("2018_5", "0");
		    	}
				
				if(area.name == '영도구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "영도구");
		    		    setHtml("2016_1", "4"); setHtml("2016_2", "7"); setHtml("2016_3", "63"); setHtml("2016_4", "553"); setHtml("2016_5", "705");
		    		    setHtml("2017_1", "1"); setHtml("2017_2", "3"); setHtml("2017_3", "51"); setHtml("2017_4", "395"); setHtml("2017_5", "641");
		    		    setHtml("2018_1", "4"); setHtml("2018_2", "2"); setHtml("2018_3", "43"); setHtml("2018_4", "324"); setHtml("2018_5", "656");
		    	}
				
				if(area.name == '동구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "동구");
		    		    setHtml("2016_1", "6"); setHtml("2016_2", "8"); setHtml("2016_3", "53"); setHtml("2016_4", "751"); setHtml("2016_5", "850");
		    		    setHtml("2017_1", "4"); setHtml("2017_2", "4"); setHtml("2017_3", "69"); setHtml("2017_4", "650"); setHtml("2017_5", "892");
		    		    setHtml("2018_1", "0"); setHtml("2018_2", "4"); setHtml("2018_3", "59"); setHtml("2018_4", "571"); setHtml("2018_5", "816");
		    	}
				
				if(area.name == '부산진구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "부산진구");
		    		    setHtml("2016_1", "5"); setHtml("2016_2", "16"); setHtml("2016_3", "259"); setHtml("2016_4", "3021"); setHtml("2016_5", "3246");
		    		    setHtml("2017_1", "9"); setHtml("2017_2", "13"); setHtml("2017_3", "330"); setHtml("2017_4", "2465"); setHtml("2017_5", "3270");
		    		    setHtml("2018_1", "1"); setHtml("2018_2", "17"); setHtml("2018_3", "309"); setHtml("2018_4", "2342"); setHtml("2018_5", "3248");
		    	}
				
				if(area.name == '서구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "서구");
		    		    setHtml("2016_1", "1"); setHtml("2016_2", "0"); setHtml("2016_3", "11"); setHtml("2016_4", "186"); setHtml("2016_5", "204");
		    		    setHtml("2017_1", "0"); setHtml("2017_2", "0"); setHtml("2017_3", "0"); setHtml("2017_4", "0"); setHtml("2017_5", "0");
		    		    setHtml("2018_1", "0"); setHtml("2018_2", "0"); setHtml("2018_3", "0"); setHtml("2018_4", "0"); setHtml("2018_5", "0");
		    	}
				
				if(area.name == '남구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "남구");
		    		    setHtml("2016_1", "7"); setHtml("2016_2", "10"); setHtml("2016_3", "133"); setHtml("2016_4", "1698"); setHtml("2016_5", "2127");
		    		    setHtml("2017_1", "12"); setHtml("2017_2", "19"); setHtml("2017_3", "165"); setHtml("2017_4", "1711"); setHtml("2017_5", "2166");
		    		    setHtml("2018_1", "8"); setHtml("2018_2", "9"); setHtml("2018_3", "181"); setHtml("2018_4", "1433"); setHtml("2018_5", "2073");
		    	}
				
				if(area.name == '해운대구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "해운대구");
		    		    setHtml("2016_1", "5"); setHtml("2016_2", "11"); setHtml("2016_3", "152"); setHtml("2016_4", "1624"); setHtml("2016_5", "2111");
		    		    setHtml("2017_1", "3"); setHtml("2017_2", "7"); setHtml("2017_3", "156"); setHtml("2017_4", "1432"); setHtml("2017_5", "2132");
		    		    setHtml("2018_1", "3"); setHtml("2018_2", "4"); setHtml("2018_3", "163"); setHtml("2018_4", "1377"); setHtml("2018_5", "1980");
		    	}
				
				if(area.name == '수영구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "수영구");
		    		    setHtml("2016_1", "5"); setHtml("2016_2", "11"); setHtml("2016_3", "152"); setHtml("2016_4", "1624"); setHtml("2016_5", "2111");
		    		    setHtml("2017_1", "3"); setHtml("2017_2", "7"); setHtml("2017_3", "156"); setHtml("2017_4", "1432"); setHtml("2017_5", "2132");
		    		    setHtml("2018_1", "3"); setHtml("2018_2", "4"); setHtml("2018_3", "163"); setHtml("2018_4", "1377"); setHtml("2018_5", "1980");
		    	}
				
				if(area.name == '사상구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "사상구");
		    		    setHtml("2016_1", "9"); setHtml("2016_2", "10"); setHtml("2016_3", "86"); setHtml("2016_4", "1140"); setHtml("2016_5", "1372");
		    		    setHtml("2017_1", "7"); setHtml("2017_2", "10"); setHtml("2017_3", "100"); setHtml("2017_4", "1110"); setHtml("2017_5", "1164");
		    		    setHtml("2018_1", "5"); setHtml("2018_2", "7"); setHtml("2018_3", "32"); setHtml("2018_4", "912"); setHtml("2018_5", "567");
		    	}
				
				if(area.name == '금정구'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "금정구");
		    		    setHtml("2016_1", "4"); setHtml("2016_2", "6"); setHtml("2016_3", "74"); setHtml("2016_4", "1017"); setHtml("2016_5", "1137");
		    		    setHtml("2017_1", "1"); setHtml("2017_2", "4"); setHtml("2017_3", "94"); setHtml("2017_4", "919"); setHtml("2017_5", "1048");
		    		    setHtml("2018_1", "4"); setHtml("2018_2", "7"); setHtml("2018_3", "86"); setHtml("2018_4", "944"); setHtml("2018_5", "1125");
		    	}
				
				if(area.name == '사하구'){
			          
			          function setHtml(item_id, item_html)
			             {
			                 obj = document.getElementById(item_id);
			                 if (obj == null) {
			                     return;
			                 }
			                 obj.innerHTML = item_html;
			             }
						  setHtml("area_name", "사하구");
			              setHtml("2016_1", "2"); setHtml("2016_2", "7"); setHtml("2016_3", "24"); setHtml("2016_4", "1149"); setHtml("2016_5", "1626");
			              setHtml("2017_1", "3"); setHtml("2017_2", "4"); setHtml("2017_3", "66"); setHtml("2017_4", "1079"); setHtml("2017_5", "1688");
			              setHtml("2018_1", "2"); setHtml("2018_2", "4"); setHtml("2018_3", "42"); setHtml("2018_4", "1042"); setHtml("2018_5", "1680");
			       }
				
				if(area.name == '연제구'){
			          
			          function setHtml(item_id, item_html)
			             {
			                 obj = document.getElementById(item_id);
			                 if (obj == null) {
			                     return;
			                 }
			                 obj.innerHTML = item_html;
			             }
			          	  setHtml("area_name", "연제구");
			              setHtml("2016_1", "2"); setHtml("2016_2", "12"); setHtml("2016_3", "89"); setHtml("2016_4", "1051"); setHtml("2016_5", "1655");
			              setHtml("2017_1", "2"); setHtml("2017_2", "6"); setHtml("2017_3", "141"); setHtml("2017_4", "1012"); setHtml("2017_5", "1549");
			              setHtml("2018_1", "5"); setHtml("2018_2", "8"); setHtml("2018_3", "87"); setHtml("2018_4", "974"); setHtml("2018_5", "1576");
			       }
				
				if(area.name == '강서구'){
			          
			          function setHtml(item_id, item_html)
			             {
			                 obj = document.getElementById(item_id);
			                 if (obj == null) {
			                     return;
			                 }
			                 obj.innerHTML = item_html;
			             }
			          	  setHtml("area_name", "강서구");
			              setHtml("2016_1", "2"); setHtml("2016_2", "3"); setHtml("2016_3", "29"); setHtml("2016_4", "500"); setHtml("2016_5", "439");
			              setHtml("2017_1", "1"); setHtml("2017_2", "1"); setHtml("2017_3", "29"); setHtml("2017_4", "513"); setHtml("2017_5", "471");
			              setHtml("2018_1", "2"); setHtml("2018_2", "1"); setHtml("2018_3", "43"); setHtml("2018_4", "492"); setHtml("2018_5", "483");
			       }
				
				if(area.name == '북구'){
			          
			          function setHtml(item_id, item_html)
			             {
			                 obj = document.getElementById(item_id);
			                 if (obj == null) {
			                     return;
			                 }
			                 obj.innerHTML = item_html;
			             }
			          	  setHtml("area_name", "북구");
			              setHtml("2016_1", "2"); setHtml("2016_2", "14"); setHtml("2016_3", "123"); setHtml("2016_4", "1040"); setHtml("2016_5", "154");
			              setHtml("2017_1", "6"); setHtml("2017_2", "12"); setHtml("2017_3", "87"); setHtml("2017_4", "1039"); setHtml("2017_5", "1521");
			              setHtml("2018_1", "6"); setHtml("2018_2", "3"); setHtml("2018_3", "67"); setHtml("2018_4", "793"); setHtml("2018_5", "1407");
			       }
		    	
		    	if(area.name == '기장군'){
		    		
		    		function setHtml(item_id, item_html)
		    		   {
		    		       obj = document.getElementById(item_id);
		    		       if (obj == null) {
		    		           return;
		    		       }
		    		       obj.innerHTML = item_html;
		    		   }
		    			setHtml("area_name", "기장군");
		    		    setHtml("2016_1", "0"); setHtml("2016_2", "0"); setHtml("2016_3", "0"); setHtml("2016_4", "0"); setHtml("2016_5", "0");
		    		    setHtml("2017_1", "0"); setHtml("2017_2", "0"); setHtml("2017_3", "0"); setHtml("2017_4", "0"); setHtml("2017_5", "0");
		    		    setHtml("2018_1", "0"); setHtml("2018_2", "0"); setHtml("2018_3", "0"); setHtml("2018_4", "0"); setHtml("2018_5", "0");
		    	}
		    });
		}
		
		/* 년도별 스크립트 */
		
		var chart = bb.generate({
			  data: {
			    columns: [
				["2016년", 7.4, 6.1, 11.6, 26.5, 8.3, 40.1],
				["2017년", 8.7, 7.0, 12.4, 24.7, 9.9, 37.4],
				["2018년", 6.4, 6.7, 12.9, 22.0, 10.8, 41.2]
			    ]
			  },
			  legend:{
				position: "right"  
			  },
			  axis: {
			    x: {
			      type: "category",
			      categories: [
			        "새벽\n04:00-05:59",
			        "아침\n07:00-08:59",
			        "오전\n09:00-11:59",
			        "오후\n12:00-17:00",
			        "저녁\n18:00-19:59",
			        "밤\n20:00-03:59"
			      ]
			    }
			  },
			  bindto: "#categoryAxis"
			});
		
		
		function murder(){
			var con = document.getElementById("murder");
				con.style.display = 'block';
				var offset = $("#murder").offset();
				$('html, body').animate({scrollTop:offset.top},400)
			};
			
			function murderback(){
				var con = document.getElementById("murder");
				con.style.display = 'none';
			};
		
		function robber(){
			var con = document.getElementById("robber");
				con.style.display = 'block';
				var offset = $("#robber").offset();
				$('html, body').animate({scrollTop:offset.top},400)
			};
		
		function robberback(){
			var con = document.getElementById("robber");
			con.style.display = 'none';
		};
		
		function rape(){
			var con = document.getElementById("rape");
				con.style.display = 'block';
				var offset = $("#rape").offset();
				$('html, body').animate({scrollTop:offset.top},400)
			};
		
		function rapeback(){
			var con = document.getElementById("rape");
			con.style.display = 'none';
		};
		
		function thief(){
			var con = document.getElementById("thief");
				con.style.display = 'block';
				var offset = $("#thief").offset();
				$('html, body').animate({scrollTop:offset.top},400)
			};
		
		function thiefback(){
			var con = document.getElementById("thief");
			con.style.display = 'none';
		};
		
		function violence(){
			var con = document.getElementById("violence");
				con.style.display = 'block';
				var offset = $("#violence").offset();
				$('html, body').animate({scrollTop:offset.top},400)
			};
		
		function violenceback(){
			var con = document.getElementById("violence");
			con.style.display = 'none';
		};
		
		function back(){
			var offset = $("#total").offset();
			$('html, body').animate({scrollTop:offset.top},400)
		};
	</script>
	
	<!-- 각 범죄별 통계 -->
	<script type="text/javascript">
		/* 살인 */
		var chart1 = new CanvasJS.Chart("chartContainer1", {
			animationEnabled: true,
			data: [{
				type: "pie",
				startAngle: 240,
				yValueFormatString: "##0.00\"%\"",
				indexLabel: "{label} {y}",
				dataPoints: [
					{ y: 1.1, label: "고용/피고용/거래관계" },
					{ y: 25.5, label: "친족" },
					{ y: 16.8, label: "이웃/지인" },
					{ y: 20.3, label: "타인" },
					{ y: 20.4, label: "기타" },
					{ y: 8.1, label: "친구/직장동료" },
					{ y: 7.8, label: "애인" }
				]
			}]
		});
		chart1.render();
		
		// 로딩 완료시 함수 실행하여 차트 생성
		google.charts.setOnLoadCallback(drawChart1);
		
		var chart_options1 = {
			width : 640,
			height : 350,
			bar : {
				groupWidth : '40%'
			},
			legend : {
				position : 'none'
			}
		};
		
		function drawChart1(){
		
			var data1 = google.visualization.arrayToDataTable([
				['', '', {role : 'annotation'}], // 그래프 위에 설명 추가 {role : 'annotation'}
				['살인', 84.7, '84.7'], // 맨뒤 내용 "개 4" 는 그래프에 표시될 설명 지정 (안하면 에러남)
				['존속살해', 8.4, '8.4'], // [항목이름, 값(숫자), 그래프 설명]
				['영아살해', 0.8, ''],
				['촉탁살인', 0.4, ''],
				['자살교사/방조', 5.8, '5.8']
			]);
		
			var chart1 = new google.visualization.ColumnChart(document.getElementById('chart_div1'));
			chart1.draw(data1, chart_options1);
		}
	</script>
</html>